#include <stdio.h>

void f(int *p)//定义了一个名字叫p的 **地址变量**，它是int *类型的
{
    printf("p = %#X\n", p);//p是一个 地址变量
    printf("*p = %#X\n", *p);//这的*p就是i，i就是*p，

    printf("&p = %#X\n", &p);//查看p在内存中的地址，虽然p是一个地址变量，
    // 但p也是有一个地址在内存中
    printf("**************\n");

    *p = 10;//*p的改变也会导致i的值的改变
    printf("*p = %d\n", *p);//10进制表示
    printf("*p = %#X\n", *p);//16进制表示
    printf("&p = %#X\n", &p);//输出地址变量p的地址，应该不变
    printf("p = %#X\n", p);//输出地址变量p的值，应该也不会改变，这是i的地址，i的地址不会改变//
    //改变的是什么，改变的是变量i的值，而不是地址的值！！！！！
    printf("**********************\n");
}

int main(void)
{
    int i = 5;
    printf("i = %d\n", i);//10进制表示
    printf("i = %#X\n", i);//16进制表示
    printf("&i = %#X\n", &i);//i变量的地址--16进制表示
    printf("**********************\n");
    f(&i);//调用f函数
    printf("i = %d\n", i);//由于指向i的指针*p改变，故这的i也就改变了
    printf("i = %#X\n", i);//变了
    printf("&i = %#X\n", &i);//i变量的地址的值不会发生改变
    printf("**********************\n");
    return 0;
}

//*p就是i，i就是*p,改变*p就是改变i
//要明确一点就是变量的类型
//*p指向了变量i，那么*p就是i，i就是*p，谁改变都会影响对方！！！